ExperimentResults/multiple-producer-1-to-single-consumer.txt
41210 records sent, 8212.4 records/sec (7.83 MB/sec), 613.2 ms avg latency, 1980.0 ms max latency.
58064 records sent, 11603.5 records/sec (11.07 MB/sec), 337.2 ms avg latency, 2072.0 ms max latency.
44842 records sent, 8934.4 records/sec (8.52 MB/sec), 198.9 ms avg latency, 948.0 ms max latency.
27492 records sent, 5475.4 records/sec (5.22 MB/sec), 1395.5 ms avg latency, 3306.0 ms max latency.
17136 records sent, 3419.0 records/sec (3.26 MB/sec), 4065.3 ms avg latency, 6652.0 ms max latency.
20916 records sent, 4177.4 records/sec (3.98 MB/sec), 7841.6 ms avg latency, 9443.0 ms max latency.
29484 records sent, 5717.3 records/sec (5.45 MB/sec), 10447.9 ms avg latency, 11948.0 ms max latency.
32634 records sent, 6520.3 records/sec (6.22 MB/sec), 11231.9 ms avg latency, 12823.0 ms max latency.
11970 records sent, 2392.6 records/sec (2.28 MB/sec), 12342.2 ms avg latency, 14455.0 ms max latency.
25452 records sent, 5070.1 records/sec (4.84 MB/sec), 13831.6 ms avg latency, 15085.0 ms max latency.
11844 records sent, 2354.2 records/sec (2.25 MB/sec), 15745.9 ms avg latency, 18718.0 ms max latency.
6930 records sent, 1353.8 records/sec (1.29 MB/sec), 19366.2 ms avg latency, 22688.0 ms max latency.
32130 records sent, 6417.0 records/sec (6.12 MB/sec), 20415.7 ms avg latency, 24035.0 ms max latency.
22806 records sent, 4413.8 records/sec (4.21 MB/sec), 17633.7 ms avg latency, 20201.0 ms max latency.
24444 records sent, 4887.8 records/sec (4.66 MB/sec), 14414.8 ms avg latency, 20434.0 ms max latency.
22428 records sent, 4473.1 records/sec (4.27 MB/sec), 13605.1 ms avg latency, 15551.0 ms max latency.
34902 records sent, 6954.0 records/sec (6.63 MB/sec), 13217.9 ms avg latency, 16175.0 ms max latency.
17514 records sent, 3443.6 records/sec (3.28 MB/sec), 11976.9 ms avg latency, 15402.0 ms max latency.
19656 records sent, 3924.9 records/sec (3.74 MB/sec), 13870.2 ms avg latency, 16937.0 ms max latency.
16002 records sent, 3180.0 records/sec (3.03 MB/sec), 15400.6 ms avg latency, 18291.0 ms max latency.
24444 records sent, 4870.3 records/sec (4.64 MB/sec), 17440.7 ms avg latency, 20185.0 ms max latency.
16632 records sent, 3313.8 records/sec (3.16 MB/sec), 17002.0 ms avg latency, 21278.0 ms max latency.
25200 records sent, 4995.0 records/sec (4.76 MB/sec), 16184.2 ms avg latency, 20111.0 ms max latency.
12096 records sent, 2335.1 records/sec (2.23 MB/sec), 15914.0 ms avg latency, 20304.0 ms max latency.
18270 records sent, 3639.4 records/sec (3.47 MB/sec), 18123.7 ms avg latency, 21519.0 ms max latency.
23814 records sent, 4755.2 records/sec (4.53 MB/sec), 18214.5 ms avg latency, 22586.0 ms max latency.
20538 records sent, 4046.1 records/sec (3.86 MB/sec), 17202.1 ms avg latency, 21787.0 ms max latency.
21672 records sent, 4321.4 records/sec (4.12 MB/sec), 16662.8 ms avg latency, 23953.0 ms max latency.
21672 records sent, 4279.6 records/sec (4.08 MB/sec), 14600.7 ms avg latency, 19564.0 ms max latency.
23688 records sent, 4699.1 records/sec (4.48 MB/sec), 15351.3 ms avg latency, 19046.0 ms max latency.
19152 records sent, 3822.8 records/sec (3.65 MB/sec), 14777.2 ms avg latency, 19135.0 ms max latency.
26712 records sent, 5325.4 records/sec (5.08 MB/sec), 14874.3 ms avg latency, 18958.0 ms max latency.
15372 records sent, 3039.1 records/sec (2.90 MB/sec), 14388.6 ms avg latency, 18168.0 ms max latency.
16002 records sent, 3185.7 records/sec (3.04 MB/sec), 16738.0 ms avg latency, 20526.0 ms max latency.
13356 records sent, 2598.4 records/sec (2.48 MB/sec), 18175.8 ms avg latency, 22706.0 ms max latency.
18774 records sent, 3751.8 records/sec (3.58 MB/sec), 19402.1 ms avg latency, 23610.0 ms max latency.
9072 records sent, 1766.4 records/sec (1.68 MB/sec), 20892.6 ms avg latency, 27639.0 ms max latency.
18900 records sent, 3767.9 records/sec (3.59 MB/sec), 22516.8 ms avg latency, 27972.0 ms max latency.
21168 records sent, 4210.0 records/sec (4.01 MB/sec), 21509.1 ms avg latency, 28326.0 ms max latency.
18396 records sent, 3003.4 records/sec (2.86 MB/sec), 19164.8 ms avg latency, 25259.0 ms max latency.
17892 records sent, 3504.1 records/sec (3.34 MB/sec), 20015.9 ms avg latency, 26472.0 ms max latency.
16758 records sent, 3279.5 records/sec (3.13 MB/sec), 18872.1 ms avg latency, 24967.0 ms max latency.
20538 records sent, 4023.9 records/sec (3.84 MB/sec), 18849.6 ms avg latency, 23984.0 ms max latency.
21924 records sent, 4384.8 records/sec (4.18 MB/sec), 18582.6 ms avg latency, 23940.0 ms max latency.
20916 records sent, 4183.2 records/sec (3.99 MB/sec), 16793.2 ms avg latency, 23397.0 ms max latency.
27405 records sent, 5481.0 records/sec (5.23 MB/sec), 14969.4 ms avg latency, 19892.0 ms max latency.
10017 records sent, 1992.6 records/sec (1.90 MB/sec), 14768.2 ms avg latency, 20534.0 ms max latency.
10710 records sent, 2126.3 records/sec (2.03 MB/sec), 17939.6 ms avg latency, 23461.0 ms max latency.
17262 records sent, 3451.0 records/sec (3.29 MB/sec), 19599.9 ms avg latency, 24827.0 ms max latency.
9576 records sent, 1904.5 records/sec (1.82 MB/sec), 20560.1 ms avg latency, 27623.0 ms max latency.
16632 records sent, 3316.5 records/sec (3.16 MB/sec), 23039.3 ms avg latency, 28840.0 ms max latency.
9702 records sent, 1899.7 records/sec (1.81 MB/sec), 24207.7 ms avg latency, 32618.0 ms max latency.
6426 records sent, 1277.0 records/sec (1.22 MB/sec), 27835.9 ms avg latency, 36922.0 ms max latency.
10836 records sent, 2143.6 records/sec (2.04 MB/sec), 28775.1 ms avg latency, 39574.0 ms max latency.
14742 records sent, 2925.0 records/sec (2.79 MB/sec), 28670.4 ms avg latency, 40014.0 ms max latency.
10332 records sent, 1913.3 records/sec (1.82 MB/sec), 28552.5 ms avg latency, 37172.0 ms max latency.
44352 records sent, 8836.8 records/sec (8.43 MB/sec), 23129.6 ms avg latency, 38409.0 ms max latency.
57708 records sent, 11539.3 records/sec (11.00 MB/sec), 9219.2 ms avg latency, 26795.0 ms max latency.
49770 records sent, 9914.3 records/sec (9.46 MB/sec), 5795.3 ms avg latency, 8684.0 ms max latency.
42462 records sent, 8470.4 records/sec (8.08 MB/sec), 6797.8 ms avg latency, 10316.0 ms max latency.
13734 records sent, 2744.6 records/sec (2.62 MB/sec), 9795.3 ms avg latency, 14472.0 ms max latency.
9576 records sent, 1911.4 records/sec (1.82 MB/sec), 12178.8 ms avg latency, 18448.0 ms max latency.
2646 records sent, 448.4 records/sec (0.43 MB/sec), 14074.8 ms avg latency, 21136.0 ms max latency.
24570 records sent, 4908.1 records/sec (4.68 MB/sec), 19861.6 ms avg latency, 27904.0 ms max latency.
44307 records sent, 8834.9 records/sec (8.43 MB/sec), 17545.4 ms avg latency, 26938.0 ms max latency.
38052 records sent, 7602.8 records/sec (7.25 MB/sec), 11686.1 ms avg latency, 26391.0 ms max latency.
35410 records sent, 7055.2 records/sec (6.73 MB/sec), 8611.0 ms avg latency, 14081.0 ms max latency.
39438 records sent, 7868.7 records/sec (7.50 MB/sec), 9064.9 ms avg latency, 13880.0 ms max latency.
41958 records sent, 8366.5 records/sec (7.98 MB/sec), 8427.0 ms avg latency, 13395.0 ms max latency.
32256 records sent, 6449.9 records/sec (6.15 MB/sec), 7903.9 ms avg latency, 12780.0 ms max latency.
47250 records sent, 9440.6 records/sec (9.00 MB/sec), 8459.7 ms avg latency, 13974.0 ms max latency.
42966 records sent, 8586.3 records/sec (8.19 MB/sec), 8031.3 ms avg latency, 13762.0 ms max latency.
42210 records sent, 8249.0 records/sec (7.87 MB/sec), 7268.8 ms avg latency, 13356.0 ms max latency.
29484 records sent, 5852.3 records/sec (5.58 MB/sec), 8383.4 ms avg latency, 14016.0 ms max latency.
22806 records sent, 4533.1 records/sec (4.32 MB/sec), 10217.7 ms avg latency, 16290.0 ms max latency.
9828 records sent, 1361.2 records/sec (1.30 MB/sec), 11788.5 ms avg latency, 19703.0 ms max latency.
41076 records sent, 8197.2 records/sec (7.82 MB/sec), 16705.7 ms avg latency, 25201.0 ms max latency.
39186 records sent, 7832.5 records/sec (7.47 MB/sec), 12378.9 ms avg latency, 22502.0 ms max latency.
35406 records sent, 7079.8 records/sec (6.75 MB/sec), 9604.6 ms avg latency, 20936.0 ms max latency.
35658 records sent, 7115.9 records/sec (6.79 MB/sec), 8788.9 ms avg latency, 14630.0 ms max latency.
36540 records sent, 7305.1 records/sec (6.97 MB/sec), 9019.2 ms avg latency, 14892.0 ms max latency.
23310 records sent, 4649.9 records/sec (4.43 MB/sec), 9869.4 ms avg latency, 16808.0 ms max latency.
34524 records sent, 6889.6 records/sec (6.57 MB/sec), 11104.8 ms avg latency, 17133.0 ms max latency.
36288 records sent, 7197.1 records/sec (6.86 MB/sec), 9866.7 ms avg latency, 17184.0 ms max latency.
22050 records sent, 4394.2 records/sec (4.19 MB/sec), 10907.3 ms avg latency, 18485.0 ms max latency.
33264 records sent, 6642.2 records/sec (6.33 MB/sec), 10992.6 ms avg latency, 18264.0 ms max latency.
39816 records sent, 7958.4 records/sec (7.59 MB/sec), 10227.5 ms avg latency, 17926.0 ms max latency.
50148 records sent, 9957.9 records/sec (9.50 MB/sec), 8381.9 ms avg latency, 17734.0 ms max latency.
40824 records sent, 8125.8 records/sec (7.75 MB/sec), 7234.1 ms avg latency, 12676.0 ms max latency.
29232 records sent, 5832.4 records/sec (5.56 MB/sec), 7969.1 ms avg latency, 13848.0 ms max latency.
38808 records sent, 7743.0 records/sec (7.38 MB/sec), 9229.8 ms avg latency, 15108.0 ms max latency.
40824 records sent, 8158.3 records/sec (7.78 MB/sec), 9059.3 ms avg latency, 16064.0 ms max latency.
41958 records sent, 8378.2 records/sec (7.99 MB/sec), 8243.4 ms avg latency, 15736.0 ms max latency.
57582 records sent, 11511.8 records/sec (10.98 MB/sec), 6574.8 ms avg latency, 15261.0 ms max latency.
40824 records sent, 6209.9 records/sec (5.92 MB/sec), 6179.8 ms avg latency, 13525.0 ms max latency.
42462 records sent, 8473.8 records/sec (8.08 MB/sec), 7832.8 ms avg latency, 18705.0 ms max latency.
40194 records sent, 8022.8 records/sec (7.65 MB/sec), 8256.2 ms avg latency, 18047.0 ms max latency.
28854 records sent, 5769.6 records/sec (5.50 MB/sec), 9412.6 ms avg latency, 19976.0 ms max latency.
16506 records sent, 3299.9 records/sec (3.15 MB/sec), 11002.1 ms avg latency, 23712.0 ms max latency.
29862 records sent, 5958.1 records/sec (5.68 MB/sec), 11008.2 ms avg latency, 24252.0 ms max latency.
43092 records sent, 8604.6 records/sec (8.21 MB/sec), 11360.8 ms avg latency, 22894.0 ms max latency.
45360 records sent, 9072.0 records/sec (8.65 MB/sec), 9818.8 ms avg latency, 22398.0 ms max latency.
44730 records sent, 8940.6 records/sec (8.53 MB/sec), 7802.3 ms avg latency, 18444.0 ms max latency.
44982 records sent, 8989.2 records/sec (8.57 MB/sec), 7170.7 ms avg latency, 14657.0 ms max latency.
46494 records sent, 9274.7 records/sec (8.85 MB/sec), 7361.1 ms avg latency, 15380.0 ms max latency.
43092 records sent, 8599.5 records/sec (8.20 MB/sec), 7317.2 ms avg latency, 14975.0 ms max latency.
6048 records sent, 302.8 records/sec (0.29 MB/sec), 7568.3 ms avg latency, 21383.0 ms max latency.
85554 records sent, 17046.0 records/sec (16.26 MB/sec), 17226.3 ms avg latency, 34584.0 ms max latency.
1638 records sent, 325.6 records/sec (0.31 MB/sec), 18517.0 ms avg latency, 34375.0 ms max latency.
39816 records sent, 7936.2 records/sec (7.57 MB/sec), 17782.1 ms avg latency, 36990.0 ms max latency.
51786 records sent, 10348.9 records/sec (9.87 MB/sec), 8313.5 ms avg latency, 16438.0 ms max latency.
34398 records sent, 6870.0 records/sec (6.55 MB/sec), 8718.3 ms avg latency, 18647.0 ms max latency.
32508 records sent, 6496.4 records/sec (6.20 MB/sec), 8548.1 ms avg latency, 14827.0 ms max latency.
37548 records sent, 7499.1 records/sec (7.15 MB/sec), 8513.7 ms avg latency, 16778.0 ms max latency.
46368 records sent, 9264.3 records/sec (8.84 MB/sec), 8669.9 ms avg latency, 16763.0 ms max latency.
13104 records sent, 1880.1 records/sec (1.79 MB/sec), 8181.4 ms avg latency, 20301.0 ms max latency.
2268 records sent, 444.4 records/sec (0.42 MB/sec), 13191.2 ms avg latency, 25134.0 ms max latency.
62496 records sent, 12442.0 records/sec (11.87 MB/sec), 12978.8 ms avg latency, 25465.0 ms max latency.
4284 records sent, 692.3 records/sec (0.66 MB/sec), 13493.9 ms avg latency, 26396.0 ms max latency.
756 records sent, 118.7 records/sec (0.11 MB/sec), 19052.3 ms avg latency, 32014.0 ms max latency.
756 records sent, 149.3 records/sec (0.14 MB/sec), 27896.2 ms avg latency, 38300.0 ms max latency.
31626 records sent, 6318.9 records/sec (6.03 MB/sec), 33294.5 ms avg latency, 40384.0 ms max latency.
37422 records sent, 7317.6 records/sec (6.98 MB/sec), 19379.0 ms avg latency, 30030.0 ms max latency.
32004 records sent, 6374.0 records/sec (6.08 MB/sec), 14798.0 ms avg latency, 31498.0 ms max latency.
31752 records sent, 6301.3 records/sec (6.01 MB/sec), 9628.8 ms avg latency, 14710.0 ms max latency.
27468 records sent, 5446.8 records/sec (5.19 MB/sec), 10762.6 ms avg latency, 16353.0 ms max latency.
26964 records sent, 5384.2 records/sec (5.13 MB/sec), 11638.5 ms avg latency, 17153.0 ms max latency.
2646 records sent, 477.6 records/sec (0.46 MB/sec), 12472.0 ms avg latency, 21638.0 ms max latency.
5796 records sent, 1150.0 records/sec (1.10 MB/sec), 21804.0 ms avg latency, 26027.0 ms max latency.
13356 records sent, 2364.3 records/sec (2.25 MB/sec), 21887.6 ms avg latency, 28817.0 ms max latency.
3024 records sent, 465.1 records/sec (0.44 MB/sec), 25335.2 ms avg latency, 36477.0 ms max latency.
882 records sent, 176.4 records/sec (0.17 MB/sec), 33673.0 ms avg latency, 41233.0 ms max latency.
2898 records sent, 543.8 records/sec (0.52 MB/sec), 38053.5 ms avg latency, 45101.0 ms max latency.
27486 records sent, 5206.7 records/sec (4.97 MB/sec), 29923.9 ms avg latency, 48535.0 ms max latency.
34625 records sent, 6875.5 records/sec (6.56 MB/sec), 33097.5 ms avg latency, 49060.0 ms max latency.
31848 records sent, 6369.6 records/sec (6.07 MB/sec), 19014.7 ms avg latency, 45628.0 ms max latency.
31059 records sent, 6209.3 records/sec (5.92 MB/sec), 9081.1 ms avg latency, 18572.0 ms max latency.
29207 records sent, 5827.4 records/sec (5.56 MB/sec), 10676.3 ms avg latency, 17011.0 ms max latency.
33613 records sent, 6722.6 records/sec (6.41 MB/sec), 13422.3 ms avg latency, 17120.0 ms max latency.
24587 records sent, 4907.6 records/sec (4.68 MB/sec), 11685.2 ms avg latency, 15207.0 ms max latency.
11199 records sent, 2211.5 records/sec (2.11 MB/sec), 12774.9 ms avg latency, 17628.0 ms max latency.
5385 records sent, 1048.1 records/sec (1.00 MB/sec), 16270.2 ms avg latency, 21879.0 ms max latency.
6809 records sent, 1296.5 records/sec (1.24 MB/sec), 21152.3 ms avg latency, 25743.0 ms max latency.
11104 records sent, 2219.9 records/sec (2.12 MB/sec), 24750.6 ms avg latency, 29484.0 ms max latency.
25079 records sent, 5015.8 records/sec (4.78 MB/sec), 24874.3 ms avg latency, 31051.0 ms max latency.
29327 records sent, 5863.1 records/sec (5.59 MB/sec), 20586.5 ms avg latency, 31152.0 ms max latency.
41158 records sent, 8223.4 records/sec (7.84 MB/sec), 13915.1 ms avg latency, 30998.0 ms max latency.
37322 records sent, 7316.6 records/sec (6.98 MB/sec), 9413.8 ms avg latency, 15050.0 ms max latency.
36264 records sent, 6949.8 records/sec (6.63 MB/sec), 9228.8 ms avg latency, 13531.0 ms max latency.
43120 records sent, 8402.2 records/sec (8.01 MB/sec), 8448.6 ms avg latency, 12611.0 ms max latency.
40509 records sent, 8072.7 records/sec (7.70 MB/sec), 7387.2 ms avg latency, 12312.0 ms max latency.
31700 records sent, 6337.5 records/sec (6.04 MB/sec), 8144.4 ms avg latency, 13195.0 ms max latency.
34777 records sent, 6893.4 records/sec (6.57 MB/sec), 9286.9 ms avg latency, 14308.0 ms max latency.
26404 records sent, 5251.4 records/sec (5.01 MB/sec), 10001.5 ms avg latency, 15572.0 ms max latency.
30590 records sent, 5912.3 records/sec (5.64 MB/sec), 10642.5 ms avg latency, 16985.0 ms max latency.
28098 records sent, 5610.6 records/sec (5.35 MB/sec), 11119.6 ms avg latency, 16986.0 ms max latency.
4284 records sent, 782.8 records/sec (0.75 MB/sec), 12956.6 ms avg latency, 21165.0 ms max latency.
756 records sent, 91.0 records/sec (0.09 MB/sec), 18506.1 ms avg latency, 26452.0 ms max latency.
4347 records sent, 858.9 records/sec (0.82 MB/sec), 25476.5 ms avg latency, 34692.0 ms max latency.
22050 records sent, 4395.9 records/sec (4.19 MB/sec), 23946.1 ms avg latency, 36432.0 ms max latency.
25704 records sent, 5135.7 records/sec (4.90 MB/sec), 24527.8 ms avg latency, 36940.0 ms max latency.
28442 records sent, 5659.0 records/sec (5.40 MB/sec), 25246.3 ms avg latency, 37362.0 ms max latency.
26208 records sent, 5239.5 records/sec (5.00 MB/sec), 19118.6 ms avg latency, 37490.0 ms max latency.
29547 records sent, 5860.2 records/sec (5.59 MB/sec), 12073.9 ms avg latency, 18487.0 ms max latency.
25200 records sent, 4961.6 records/sec (4.73 MB/sec), 11969.2 ms avg latency, 19036.0 ms max latency.
28858 records sent, 5656.2 records/sec (5.39 MB/sec), 12574.5 ms avg latency, 19966.0 ms max latency.
28854 records sent, 5545.6 records/sec (5.29 MB/sec), 11836.4 ms avg latency, 19507.0 ms max latency.
7560 records sent, 1481.5 records/sec (1.41 MB/sec), 13059.9 ms avg latency, 22726.0 ms max latency.
1638 records sent, 308.1 records/sec (0.29 MB/sec), 17307.2 ms avg latency, 27896.0 ms max latency.
6426 records sent, 1276.8 records/sec (1.22 MB/sec), 22506.7 ms avg latency, 32102.0 ms max latency.
11340 records sent, 2248.2 records/sec (2.14 MB/sec), 23300.6 ms avg latency, 35057.0 ms max latency.
5040 records sent, 1004.0 records/sec (0.96 MB/sec), 22425.5 ms avg latency, 38419.0 ms max latency.
19782 records sent, 3955.6 records/sec (3.77 MB/sec), 32030.5 ms avg latency, 41438.0 ms max latency.
33390 records sent, 6520.2 records/sec (6.22 MB/sec), 25812.6 ms avg latency, 39213.0 ms max latency.
34650 records sent, 6895.5 records/sec (6.58 MB/sec), 19252.0 ms avg latency, 39100.0 ms max latency.
36540 records sent, 7264.4 records/sec (6.93 MB/sec), 9995.2 ms avg latency, 25213.0 ms max latency.
24318 records sent, 4822.1 records/sec (4.60 MB/sec), 10337.1 ms avg latency, 17004.0 ms max latency.
32508 records sent, 6491.2 records/sec (6.19 MB/sec), 10578.5 ms avg latency, 17531.0 ms max latency.
19656 records sent, 3921.8 records/sec (3.74 MB/sec), 11538.8 ms avg latency, 19441.0 ms max latency.
22932 records sent, 4542.8 records/sec (4.33 MB/sec), 13151.6 ms avg latency, 21714.0 ms max latency.
19782 records sent, 3896.4 records/sec (3.72 MB/sec), 13558.1 ms avg latency, 23868.0 ms max latency.
7434 records sent, 1461.1 records/sec (1.39 MB/sec), 16748.4 ms avg latency, 26800.0 ms max latency.
28728 records sent, 5739.9 records/sec (5.47 MB/sec), 17862.3 ms avg latency, 27616.0 ms max latency.
39186 records sent, 7692.6 records/sec (7.34 MB/sec), 14622.3 ms avg latency, 27538.0 ms max latency.
37800 records sent, 7537.4 records/sec (7.19 MB/sec), 10911.8 ms avg latency, 23685.0 ms max latency.
33138 records sent, 6595.9 records/sec (6.29 MB/sec), 10777.1 ms avg latency, 18832.0 ms max latency.
34902 records sent, 6969.2 records/sec (6.65 MB/sec), 9107.1 ms avg latency, 15389.0 ms max latency.
29358 records sent, 5838.9 records/sec (5.57 MB/sec), 9796.6 ms avg latency, 17120.0 ms max latency.
22050 records sent, 4338.0 records/sec (4.14 MB/sec), 11509.3 ms avg latency, 18957.0 ms max latency.
9324 records sent, 1859.6 records/sec (1.77 MB/sec), 15240.8 ms avg latency, 21809.0 ms max latency.
8064 records sent, 1605.7 records/sec (1.53 MB/sec), 20618.7 ms avg latency, 23662.0 ms max latency.
441 records sent, 81.6 records/sec (0.08 MB/sec), 24174.5 ms avg latency, 28760.0 ms max latency.
5000000 records sent, 4942.870305 records/sec (4.71 MB/sec), 12745.12 ms avg latency, 49060.00 ms max latency, 12592 ms 50th, 31791 ms 95th, 39335 ms 99th, 47227 ms 99.9th.